{"name":"Jasper Doan","headerTaglineOne":"Hello 👋","headerTaglineTwo":"I'm Jasper Doan","headerTaglineThree":"developer","headerTaglineFour":" based in Ho Chi Minh, Vietnam","showCursor":true,"showBlog":true,"darkMode":true,"showResume":true,"socials":[{"id":"1","title":"Github","link":"https://github.com/ngthuongdoan"},{"id":"2","title":"LinkedIn","link":"https://www.linkedin.com/in/ngthuongdoan/"},{"id":"5","title":"Email","link":"mailto:ngthuongdoan@gmail.com"}],"projects":[{"id":"1","title":"Hello Bacsi","description":"Web Developer","imageSrc":"/images/hellobacsi.png","url":"https://hellobacsi.com/"},{"id":"2","title":"Project Two","description":"Web Development","imageSrc":"https://images.unsplash.com/photo-1605153864431-a2795a1b2f95?ixlib=rb-1.2.1&ixid=MXwxMjA3fDB8MHxjb2xsZWN0aW9uLXBhZ2V8MXwyNTY3ODl8fGVufDB8fHw%3D&auto=format&fit=crop&w=400&q=60","url":"http://thuongda.dev/"}],"services":[{"id":"1","title":"Web Developer","description":"Build high-performance web applications using modern stacks: React/Next.js & Vue/Nuxt.js SPAs/PWAs; TypeScript-driven development; Node.js backend systems; Firebase/Netlify integrated solutions; SEO-optimized Jamstack architecture; Enterprise-grade authentication systems; Real-time features with WebSockets"},{"id":"2","title":"Performance Optimization","description":"Advanced memoization, code splitting, and bundle analysis"},{"id":"3","title":"Migration Services","description":"Modernize legacy systems with React/Vue upgrades, TypeScript conversion, and framework transitions (Next.js/Nuxt.js). Includes hybrid operation support, automated testing, and team training for seamless transitions."},{"id":"4","title":"Server-Side Rendering (SSR) Solutions","description":"Deliver SEO-optimized, high-performance apps via Next.js/Nuxt.js SSR/SSG hybrid architectures. Features edge caching, code splitting, and enterprise-grade auth/monitoring integrations."}],"aboutpara":"Hello,\nI am a front-end developer specializing in crafting outstanding user experiences. With expertise in React.js, Vue.js, and the broader JavaScript ecosystem, I build dynamic, responsive interfaces that are both user-friendly and visually engaging. Additionally, I bring strong SEO skills, applying best practices to optimize websites for search engines and enhance online visibility.\nWith five years of industry experience, I am dedicated to delivering front-end solutions that enable businesses to achieve their objectives efficiently and effectively. I look forward to the opportunity to contribute to the success of your project.","resume":{"tagline":"👋  I'm a software engineer.","description":"I have delivered world-class user experiences to millions of people. Well-versed in React, JavaScript, and most of the Web frameworks.","experiences":[{"id":"1","dates":"November 2024 - Present","type":"Full Time","position":"Software Engineer at The Access Group","bullets":"Directed full stack transition of enterprise scale legacy applications to modern React frameworks, resolving compatibility challenges through modular decomposition"},{"id":"d495c23b-4f65-479a-9b8a-cfbc1c089725","dates":"September 2023 - October 2024","type":"Full Time","position":"Frontend Engineer at Collaboration Betters The World","bullets":"Worked on the frontend of a React application, committed to driving our vision at CBTW to better the world through collaboration.- Harness the power of the ReactJS ecosystem to  create exceptional  websites across diverse  domains, specially in a  leading SaaS technology innovator and has been  the pioneer of  e conveyancing since 2000"},{"id":"fc95e7c9-6c39-44db-bb79-2ec96f826ca2","dates":"June 2022 - August 2023","type":"Full Time","position":"Frontend Engineer at Hello Health Group","bullets":"I'm an experienced developer who is passionate about building high performance websites and components.- I spend my days creating component libraries using Storybook and integrating with Google Analytics, Google Tag Manager, Google Ads Pubmatic and MGID. -I'm also proficient in agile scrum methodologies and always seeking new opportunities to grow and learn in my career. - I'm always excited to bring my expertise to a new role and help build outstanding products."},{"id":"18c3db92-5937-4c10-bcaa-28b9fa5cf673","dates":"September 2021 - June 2022","type":"Full Time","position":"Frontend Engineer at Appcore","bullets":"Be a Frontend Developer using ReactJS Ecosystem to create websites in abundant domains. - Also, be a Leader of React  team coaching and training people to join the company."},{"id":"730df802-bc44-49a8-8ce8-59233fafefa2","dates":"April 2021 - September 2021","type":"Intern","position":"Intern Frontend Engineer at Techbase","bullets":"Distinguished Academic Achiever in Internship Program"}],"education":{"universityName":"Can Tho University","universityDate":"2017-2021","universityPara":" GPA: 3.34/4.0- The highest score student of  entrance examination for Software  Engineering (Course 43rd).  - Scholarship almost every academic semester.  - Be the vice monitor of class Software Engineering A1.  - Among 20 selected students for the AUNQA of the Software Engineering Department"},"languages":["Javascript","HTML5","CSS","Go"],"frameworks":["React","Typescript","NodeJS","NextJS","VueJS","NuxtJS"],"others":["Azure","AWS","Netlify","Firebase"]}}